backend/app/controllers/achievements_controller.rb

  def create
    achievement = current_user.achievements.new(achievement_params)
    achievement.cookie_count = rand(5..20)

    if achievement.save
---
INSERT INTO "achievements" ("description", "cookie_count", "user_id", "created_at", "updated_at") VALUES ('Прочитал 10 страниц', 12, 2, '2025-05-16 09:11:32.245121', '2025-05-16 09:11:32.245121') RETURNING "id"