backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
  def authorize_request
    header = request.headers["Authorization"]
    token = header&.split(" ")&.last

    unless token
      render json: { error: "Missing token" }, status: :unauthorized
      return
    end

    decoded = decode_token(token)
    if decoded.nil?
      render json: { error: "Invalid or expired token" }, status: :unauthorized
      return
    end

    @current_user = User.find(decoded[:user_id])