backend/app/controllers/application_controller.rb

  def authorize_request
    header = request.headers["Authorization"]
    token = header&.split(" ")&.last

    unless token
      return render json: { error: "Missing token" }, status: :unauthorized
    end

    decoded = decode_token(token)
    if decoded.nil?
      return render json: { error: "Invalid or expired token" }, status: :unauthorized
    end

    @current_user = User.find(decoded[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1