backend/app/controllers/auth_controller.rb

INSERT INTO "achievements" ("description", "cookie_count", "user_id", "created_at", "updated_at") VALUES ('Registered!', 17, 1, '2025-05-16 08:46:23.054113', '2025-05-16 08:46:23.054113') RETURNING "id"
INSERT INTO "users" ("login", "password_digest", "achievements", "cookies", "created_at", "updated_at") VALUES ('test3', '$2a$12$vhOSnJH2XhMLlXRcLgCKZOZu4nWwu3zr6xfxTIlztqj9St0WbxYr2', '["Registered!"]', NULL, '2025-05-08 07:23:01.670423', '2025-05-08 07:23:01.670423') RETURNING "id"
---
  def signup
    user = User.new(user_params)
    user.achievements.build(description: "Registered!", cookie_count: rand(5..20))
    if user.save

SELECT "users".* FROM "users" WHERE "users"."login" = 'test34' LIMIT 1
---
  def signin
    user = User.find_by(login: params[:login])